cases/Sand/clogging/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


transportModel  Newtonian;

muf         muf     	 [1 -1 -1 0 0 0 0 ] 1.2e-5;
C_det       C_det           [0 0 0 0 0 0 0] 5;
//rhos        rhos         [1 -3 0 0 0 0 0] 2000;
rhof        rhof         [1 -3 0 0 0 0 0] 1000;
D           D            [0 2 -1 0 0 0 0]  1.6e-9;
Db           Db            [0 2 -1 0 0 0 0]  1e-9;
//kd           kd            [0 0 -1 0 0 0 0]  0.01;
//psi         psi          [-1 1 2 0 0 0 0]  1;
//Weqbeta         Weqbeta          [0 0 0 0 0 0 0]  0.27;
//alphabeta0         alphabeta0          [0 0 -1 0 0 0 0]  100;
tau_max        tau_max         [1 -1 -2 0 0 0 0] 1.39;
U_attach        U_attach         [0 1 -1 0 0 0 0] 1e-8;
attachmentValue        attachmentValue         [0 0 -1 0 0 0 0] 0.001;
detachmentValue        detachmentValue         [0 0 -1 0 0 0 0] 0.001;
//Y           Y            [0 0 0 0 0 0 0] 0.35;
//k1          k1            [1 -3 0 0 0 0 0] 0.55;
Mmax          Mmax         [1 -3 0 0 0 0 0] 60;
ks            ks          [1 -3 0 0 0 0 0] 3.5e-5;
ms            ms          [0 0 -1 0 0 0 0] 3e-5;
mum           mum         [0 0 -1 0 0 0 0] 1e-3;
Yxs           Yxs          [0 0 0 0 0 0 0]  0.045;
C0            C0          [1 -3 0 0 0 0 0] 1;
//a             a            [0 0 0 0 0 0 0] 4;
//b            b           [0 0 0 0 0 0 0] 4;
//c            c           [0 2 -1 0 0 0 0] 1;
//d            d            [0 0 1 0 0 0 0] 1;
rhoMb        rhoMb       [0 0 0 0 0 0 0] 560;
// ************************************************************************* //
